app/views/connections/index.html.erb

      <tr>
        <td><%= User.find(connection.relation_id).first_name  %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]