app/controllers/connections_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "connections".* FROM "connections"  WHERE "connections"."user_id" = $1  [["user_id", 1]]
---
  def index
    user = User.find(params[:user_id])
    @connections = user.connections.map { |x|  User.find(x.relation_id)}

INSERT INTO "connections" ("comments", "created_at", "date", "location", "rating", "relation_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create

    @connection = Connection.new(connection_params)
    @connection.user_id = @user.id
    respond_to do |format|
      if @connection.save

DELETE FROM "connections" WHERE "connections"."id" = $1  [["id", 4]]
---
  def destroy
    @connection.destroy

SELECT  "connections".* FROM "connections"  WHERE "connections"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_connection
      @connection = Connection.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_user
      @user = User.find(session[:user_id])