app/controllers/connections_controller.rb

SELECT "connections".* FROM "connections"
---
  def index
    @connections = Connection.all